# RebarId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarReinforcementData..::..RebarId Property
RebarReinforcementData Class See Also
---
The id of the Rebar
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId RebarId { get; set; }
```

Visual Basic
---
```text
Public Property RebarId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ RebarId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace